# 学生证名单
a = ['安进波', '陈明浩', '陈文宇', '陈芸', '丁吉罗浩', '方世鹏', '付开进', '耿仕宇', '黄伟', '金路', '李江海', '李玘芮', '李浙江', '梁健', '罗海涛', '罗洪洋', '罗仁龙', '牟兴传', '潘灿', '潘春海', '皮永丽', '乔玉麟', '石王飞', '石文清', '唐莉亚', '谢绍银', '徐俊明', '徐庭', '许广水', '颜垠', '杨光富', '杨洪波', '杨凯', '杨明磊', '杨通权', '杨易霖', '杨云', '余进强', '张红芬', '张浚七', '张洺溢', '赵骏', '钟新运', '朱荣吉', '祖正超']
new_list = ['丁吉罗浩', '乔玉麟', '付开进', '唐莉亚', '安进波', '张浚七', '张洺溢', '张红芬', '徐俊明', '徐庭', '方世鹏', '朱荣吉', '李江海', '李浙江', '李玘芮', '杨云', '杨光富', '杨凯', '杨明磊', '杨易霖', '杨洪波', '杨通权', '梁健', '潘春海', '潘灿', '牟兴传', '皮永丽', '石文清', '石王飞', '祖正超', '罗仁龙', '罗洪洋', '罗海涛', '许广水', '陈明浩', '陈芸', '颜垠', '黄伟']
old_list = ['丁吉罗浩', '乔玉麟', '付开进', '安进波', '张洺溢', '张浚七', '徐庭', '方世鹏', '朱荣吉', '李江海', '李浙江', '杨云', '杨光富', '杨凯', '杨明磊', '杨易霖', '杨洪波', '杨通权', '梁健', '潘春海', '潘灿', '牟兴传', '石文清', '石王飞', '祖正超', '罗仁龙', '罗洪洋', '罗海涛', '陈明浩', '陈芸', '颜垠']
print('已交',len(new_list),'人')
a.sort()
# print(a)
print(f'未交学生证名单 7人:{set(new_list).symmetric_difference(set(a))}')

